import { z } from "zod";

export const signUpSchema = z.object({
  full_name: z
    .string()
    .min(5, "يجب أن يكون اسم المستخدم 5 أحرف على الأقل")
    .regex(
      /^[a-zA-Z0-9 ]+$/,
      "يجب أن يحتوي اسم المستخدم على أحرف وأرقام ومسافات فقط"
    ),

  email: z.string().email("عنوان البريد الإلكتروني غير صالح"),

  password: z
    .string()
    .min(8, "يجب أن تكون كلمة المرور 8 أحرف على الأقل")
    .regex(/[A-Z]/, "يجب أن تحتوي كلمة المرور على حرف كبير واحد على الأقل")
    .regex(/[0-9]/, "يجب أن تحتوي كلمة المرور على رقم واحد على الأقل")
    .regex(
      /[^a-zA-Z0-9]/,
      "يجب أن تحتوي كلمة المرور على رمز خاص واحد على الأقل"
    ),

  confirmPassword: z
    .string()
    .min(8, "يجب أن تكون كلمة المرور 8 أحرف على الأقل")
    .regex(/[A-Z]/, "يجب أن تحتوي كلمة المرور على حرف كبير واحد على الأقل")
    .regex(/[0-9]/, "يجب أن تحتوي كلمة المرور على رقم واحد على الأقل")
    .regex(
      /[^a-zA-Z0-9]/,
      "يجب أن تحتوي كلمة المرور على رمز خاص واحد على الأقل"
    ),

  matricule: z
    .string()
    .length(10, "المعرف يجب أن يحتوي على 10 أحرف بالضبط")
    .regex(/^[a-zA-Z0-9]+$/, "المعرف يجب أن يحتوي على أرقام أو أحرف فقط"),

  cin: z
    .string()
    .length(8, "رقم بطاقة التعريف يجب أن يحتوي على 8 أرقام بالضبط")
    .regex(/^[0-9]+$/, "رقم بطاقة التعريف يجب أن يحتوي على أرقام فقط"),
});

export const loginSchema = z.object({
  email: z.string().email("عنوان البريد الإلكتروني غير صالح"),
  password: z
    .string()
    .min(8, "يجب أن تكون كلمة المرور 8 أحرف على الأقل")
    .regex(/[A-Z]/, "يجب أن تحتوي كلمة المرور على حرف كبير واحد على الأقل")
    .regex(/[0-9]/, "يجب أن تحتوي كلمة المرور على رقم واحد على الأقل")
    .regex(
      /[^a-zA-Z0-9]/,
      "يجب أن تحتوي كلمة المرور على رمز خاص واحد على الأقل"
    ),
});

export const forgotPasswordSchema = z.object({
  email: z.string().email("عنوان البريد الإلكتروني غير صالح"),
});

export const resetPasswordSchema = z.object({
  password: z
    .string()
    .min(8, "يجب أن تكون كلمة المرور 8 أحرف على الأقل")
    .regex(/[A-Z]/, "يجب أن تحتوي كلمة المرور على حرف كبير واحد على الأقل")
    .regex(/[0-9]/, "يجب أن تحتوي كلمة المرور على رقم واحد على الأقل")
    .regex(
      /[^a-zA-Z0-9]/,
      "يجب أن تحتوي كلمة المرور على رمز خاص واحد على الأقل"
    ),
  confirmPassword: z
    .string()
    .min(8, "يجب أن تكون كلمة المرور 8 أحرف على الأقل")
    .regex(/[A-Z]/, "يجب أن تحتوي كلمة المرور على حرف كبير واحد على الأقل")
    .regex(/[0-9]/, "يجب أن تحتوي كلمة المرور على رقم واحد على الأقل")
    .regex(
      /[^a-zA-Z0-9]/,
      "يجب أن تحتوي كلمة المرور على رمز خاص واحد على الأقل"
    ),
});
